## Data Manipulation with Pandas

NumPy's ndarray data structure provides essential features for - 'clean and well-organized data' typically seen in numerical computing tasks.<br>
<b>Limitation of ndArray</b>
Limitations become clear when we need more flexibility (e.g., attaching labels to data, working with missing data, etc.) and when attempting operations that do not map well to element-wise broadcasting (e.g., groupings, pivots, etc.), each of which is an important piece of <b>analyzing the less structured data</b> available in many forms in the world around us. 

<li>Pandas is a newer package built on top of NumPy, and provides an efficient implementation of a DataFrame. DataFrames are essentially multidimensional arrays with attached row and column labels, and often with heterogeneous types and/or missing data.
<li>Pandas implements a number of powerful data operations familiar to users of both database frameworks and spreadsheet programs.

<li>

In [49]:
import pandas as pd
import numpy as np
pd.__version__

'0.20.1'

In [50]:
# Use a compound data type for structured arrays  
#For more info:  https://docs.scipy.org/doc/numpy-1.13.0/user/basics.rec.html#filling-structured-arrays
data = np.zeros(2, dtype={'names':('name', 'age', 'weight'),
                          'formats':('U10', 'i4', 'f8')})
print(data.dtype)

[('name', '<U10'), ('age', '<i4'), ('weight', '<f8')]

In [51]:
data['name'][0] = 'Jose'
data['age'][0] = 23
data['weight'][0] = 70
data['name'][1] = 'Alex'
data['age'][1] = 24
data['weight'][1] = 71
print(data[1])

('Alex', 24,  71.)

<b>Data Analysis with Pandas</b>

<li>Data structures with labeled axes supporting automatic or explicit data alignment. <br><li>This prevents common errors resulting from misaligned data and working with differently-indexed data coming from different sources.<br><li>
Integrated time series functionality.The same data structures handle both time series data and non-time series data.<br><li>
Arithmetic operations and reductions (like summing across an axis) would pass on the metadata (axis labels).<br><li>
Flexible handling of missing data.<br><li>
Merge and other relational operations found in popular database databases (SQLbased, for example).




<b>Series and Data-Frame</b>

Series is a one-dimensional array-like object containing an array of data (of any NumPy data type) and an associated array of data labels, called its index. Similarly Dataframe is two dimentional array-like object containing array of data.

In [52]:
#Sets the value of the specified option.There are many options that we can set here <NOT SURE>
pd.set_option('precision',2)

In [53]:
! ls

Hello_Python.ipynb           hello.txt
NumPy Basics.ipynb           imdb_1000.csv
Pandas Basics.ipynb          my_array.npy
Pima_Predication.ipynb       my_output.csv
Python Pandas Test.ipynb     mynew_array.npz
SciPy - Linear Algebra.ipynb pima-data.xlsx
chipotle.tsv                 ufo.csv
clipboard_data.xlsx          untitled.txt

In [54]:
df=pd.read_csv('ufo.csv')
df.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   06/01/30 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   06/01/31 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

<li><b>path</b> filelocation, URL
<li><b>sep or delimiter</b> Character sequence use to split fields in each row
<li><b>header</b> Row number to use as column names
<li><b>index_col</b> Column name to use as the row index in the result
<li><b>names</b> List of column names for result, combine with header=None
<li><b>skiprows</b> Number of rows at beginning of file to ignore
<li><b>na_values</b> Sequence of values to replace with NA
<li><b>parse_dates</b> Attempt to parse data to datetime
<li><b>nrows</b> Number of rows to read from beginning of file

In [55]:
#How to write dataframe into csv
df.to_csv('my_output.csv',index=False)

### Excel

In [56]:
#pima_excel=pd.read_excel('pima-data.xlsx', sheetname='forExport')
pima_excel=pd.ExcelFile("pima-data.xlsx")
pima_1=pima_excel.parse("forExport")
pima_1.head()

,`,glucose_conc,diastolic_bp,thickness,insulin,bmi,diab_pred,age,skin,diabetes
0,6,148,72,35,0,33.6,0.63,50,1.38,True
1,1,85,66,29,0,26.6,0.35,31,1.14,False
2,8,183,64,0,0,23.3,0.67,32,0.00,True
3,1,89,66,23,94,28.1,0.17,21,0.91,False
4,0,137,40,35,168,43.1,2.29,33,1.38,True

#### Clipboard

In [57]:
#Read text from clipboard and pass to read_table.
#data=pd.read_clipboard()
#data.to_excel('clipboard_data.xlsx',index=False)

### JSON

In [58]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 25, "pet": "Zuko"},
{"name": "Katie", "age": 33, "pet": "Cisco"}]
}
"""
obj
## The basic types are objects (dicts), arrays (lists), strings, numbers, booleans, and nulls.

'\n{"name": "Wes",\n"places_lived": ["United States", "Spain", "Germany"],\n"pet": null,\n"siblings": [{"name": "Scott", "age": 25, "pet": "Zuko"},\n{"name": "Katie", "age": 33, "pet": "Cisco"}]\n}\n'

In [59]:
import json
data=json.loads(obj)
data

{'name': 'Wes',
 'pet': None,
 'places_lived': ['United States', 'Spain', 'Germany'],
 'siblings': [{'age': 25, 'name': 'Scott', 'pet': 'Zuko'},
  {'age': 33, 'name': 'Katie', 'pet': 'Cisco'}]}

In [60]:
type(data)

dict

In [61]:
## Which all places Wes lived?
data['places_lived']

['United States', 'Spain', 'Germany']

In [62]:
# json.dumps on the other hand converts a Python object back to JSON
asjson = json.dumps(data)
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 25, "pet": "Zuko"}, {"name": "Katie", "age": 33, "pet": "Cisco"}]}'

## Series and DataFrame Methods

In [63]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [64]:
# Extract values of a series
obj.values    # show values in series

array([ 4,  7, -5,  3])

In [65]:
# Extract Index of a series :Immutable Index implementing a monotonic range. RangeIndex is a
#memory-saving special case of Int64Index limited to representing
#monotonic ranges.
obj.index     # shows index of Series

RangeIndex(start=0, stop=4, step=1)

In [66]:
obj2 = pd.Series([4,7,2,5,6,8], index=['a','b','c','d','e','f'])    
# Series with non-numerical index
obj2

a    4
b    7
c    2
d    5
e    6
f    8
dtype: int64

In [67]:
obj2.index

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [68]:
# How to get particular item value from Series based on Index ?
obj2['c']   # Numpy Index

2

In [69]:
# How to extract value from series based on numpy indexing?
obj2[2]

2

In [70]:
# Series indexing (obj[...]) works analogously to NumPy array indexing, except you can use the Series’s 
# index values instead of only integers
obj2[['a', 'b', 'd']] # selected a list of elements based on pandas_index

a    4
b    7
d    5
dtype: int64

In [71]:
#Change or overwrite a value at index 'c'
obj2['c']=11
obj2

a     4
b     7
c    11
d     5
e     6
f     8
dtype: int64

In [72]:
obj2 >= 6

a    False
b     True
c     True
d    False
e     True
f     True
dtype: bool

#### How to rename index with a prefix ?

In [73]:
obj2.add_prefix("new_")

new_a     4
new_b     7
new_c    11
new_d     5
new_e     6
new_f     8
dtype: int64

#### Selecting a range of elements

In [74]:
obj2[0:5] # selected a range based on numpy index

a     4
b     7
c    11
d     5
e     6
dtype: int64

In [75]:
obj2['c':'d']  # selecting data within range of index

c    11
d     5
dtype: int64

### Index and its importance

Index objects are immutable and thus can’t be modified by the user

In [76]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

### How to create new series with new index items?

Scenario - add new customer ids but maintain data of old customer id's

In [77]:
obj.reindex(['a', 'c', 'd', 'e','f'])     # INdex where no data is available will be filled with NaN

a   -5.3
c    3.6
d    4.5
e    NaN
f    NaN
dtype: float64

#### How to fill values if NAN comes while reindexing?

In [78]:
obj.reindex(['a', 'c', 'd', 'e','f'], fill_value=0)

a   -5.3
c    3.6
d    4.5
e    0.0
f    0.0
dtype: float64

### Advance use of Reindexing with Ordered data

In [79]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

{code}
    method : {None, 'backfill'/'bfill', 'pad'/'ffill', 'nearest'}, optional
    method to use for filling holes in reindexed DataFrame.
    Please note: this is only  applicable to DataFrames/Series with a
    monotonically increasing/decreasing index.

    * default: don't fill gaps
    * pad / ffill: propagate last valid observation forward to next
      valid
    * backfill / bfill: use next valid observation to fill gap
    * nearest: use nearest valid observations to fill gap {code}

In [80]:
obj3.reindex(range(6), method='ffill') # NOT SURE

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

### Drop entries from an axis using drop method of pandas

In [81]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [82]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [83]:
obj.drop('b',inplace=True) # droping multiple index by using square brackets

In [84]:
obj

d    4.5
a   -5.3
c    3.6
dtype: float64

### DataFrames

In [85]:
frame = pd.DataFrame(np.random.randn(27).reshape((9, 3)), 
        index=['a', 'c', 'd','e','f','g','h','i','j'],
        columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a  1.67   0.27        0.31
c  1.21   2.70       -1.21
d  1.24   2.06        0.18
e  1.51  -0.60        0.29
f -0.53   0.42       -0.44
g -0.04  -1.55        0.58
h  2.77   0.43       -0.61
i  0.66  -0.35        1.29
j  1.21   0.16        1.21

#### Reindexing with columns / Updating the column names

In [86]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a   0.27   NaN        0.31
c   2.70   NaN       -1.21
d   2.06   NaN        0.18
e  -0.60   NaN        0.29
f   0.42   NaN       -0.44
g  -1.55   NaN        0.58
h   0.43   NaN       -0.61
i  -0.35   NaN        1.29
j   0.16   NaN        1.21

In [87]:
del frame['California']   #To delete a column from DataFrame

In [88]:
frame

   Ohio  Texas
a  1.67   0.27
c  1.21   2.70
d  1.24   2.06
e  1.51  -0.60
f -0.53   0.42
g -0.04  -1.55
h  2.77   0.43
i  0.66  -0.35
j  1.21   0.16

### Data selection and filtering

In [89]:
frame

   Ohio  Texas
a  1.67   0.27
c  1.21   2.70
d  1.24   2.06
e  1.51  -0.60
f -0.53   0.42
g -0.04  -1.55
h  2.77   0.43
i  0.66  -0.35
j  1.21   0.16

In [90]:
#frame['Texas']  # selecting data from dataframe single column
frame[['Texas','Ohio']]  # selecting multicolumns from dataframe using double square brackets 
#NOT SURE, why do we use double brackets

   Texas  Ohio
a   0.27  1.67
c   2.70  1.21
d   2.06  1.24
e  -0.60  1.51
f   0.42 -0.53
g  -1.55 -0.04
h   0.43  2.77
i  -0.35  0.66
j   0.16  1.21

In [91]:
frame[:3]  # selecting first 3 cases (3 rows)

   Ohio  Texas
a  1.67   0.27
c  1.21   2.70
d  1.24   2.06

#### How to update index of both Row and Column?
<li>use square brackets to get a list of columns/rows)

#### Selecting by position

In [92]:
frame.iloc[[1],[1]]  #Selecting single value by row and coloumn

   Texas
c    2.7

In [93]:
frame.iat[0,0]    #Selecting single value by row and coloumn

1.6722046194472453

#### Selecting by Label

In [94]:
frame.loc[['a','b','c','d'], ['Texas','Ohio'] ] 
#Selecting values by row and coloumn Labels

   Texas  Ohio
a   0.27  1.67
b    NaN   NaN
c   2.70  1.21
d   2.06  1.24

In [95]:
frame.at['c','Texas']  
##Selecting single values by row and coloumn Labels

2.7013779972656224

#### By Label/Position

In [96]:
frame.ix[2]
#Select a single row

/Users/apple/anaconda/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

Ohio     1.24
Texas    2.06
Name: d, dtype: float64

In [97]:
frame.ix[:,'Texas']
#Select a single column or subset of columns

a    0.27
c    2.70
d    2.06
e   -0.60
f    0.42
g   -1.55
h    0.43
i   -0.35
j    0.16
Name: Texas, dtype: float64

#### Boolean Indexing

In [98]:
frame[frame['Texas'] > 0]  # selecting cases in df where column named Texas has value >0

   Ohio  Texas
a  1.67   0.27
c  1.21   2.70
d  1.24   2.06
f -0.53   0.42
h  2.77   0.43
j  1.21   0.16

In [99]:
frame[frame < 0] = 0  # setting all values which are <5 to 0
frame

   Ohio  Texas
a  1.67   0.27
c  1.21   2.70
d  1.24   2.06
e  1.51   0.00
f  0.00   0.42
g  0.00   0.00
h  2.77   0.43
i  0.66   0.00
j  1.21   0.16

In [100]:
data = pd.DataFrame(np.random.randn(20).reshape((5, 4)),
         index=['Ohio', 'Colorado', 'Utah', 'New York','Arizona'],
         columns=['one', 'two', 'three', 'four'])
data

           one   two  three  four
Ohio      0.86  0.13  -1.29  1.61
Colorado -0.24 -0.66  -0.96 -0.16
Utah      0.74 -1.15  -0.52 -0.34
New York  1.24  1.34  -1.37 -0.47
Arizona  -1.52 -0.43  -0.36  1.04

In [101]:
data

           one   two  three  four
Ohio      0.86  0.13  -1.29  1.61
Colorado -0.24 -0.66  -0.96 -0.16
Utah      0.74 -1.15  -0.52 -0.34
New York  1.24  1.34  -1.37 -0.47
Arizona  -1.52 -0.43  -0.36  1.04

In [102]:
data.drop(['Colorado', 'Ohio'], axis=0) 
# droping rows by using square brackets

           one   two  three  four
Utah      0.74 -1.15  -0.52 -0.34
New York  1.24  1.34  -1.37 -0.47
Arizona  -1.52 -0.43  -0.36  1.04

### Sorting and ranking
<li>Use sort_index to sort lexicographically by row or column index

In [103]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [104]:
obj.sort_index()
#To sort the index

a    1
b    2
c    3
d    0
dtype: int64

### With a DataFrame, you can sort by index on either axis

In [105]:
data = pd.DataFrame(np.random.randn(20).reshape((5, 4)),
         index=['Ohio', 'Colorado', 'Utah', 'New York','Arizona'],
         columns=['one', 'two', 'three', 'four'])
data

           one   two  three  four
Ohio      1.02  0.79  -0.86  1.03
Colorado  1.17 -0.56  -0.66  0.51
Utah      0.44  0.91  -0.63 -0.29
New York  0.88 -0.04   0.82 -2.18
Arizona  -0.82  1.24  -1.38 -0.51

#### Sort rows index in DataFrame
<li> sort_index : Sort by labels aling the axis

In [106]:
data.sort_index(axis=0)

           one   two  three  four
Arizona  -0.82  1.24  -1.38 -0.51
Colorado  1.17 -0.56  -0.66  0.51
New York  0.88 -0.04   0.82 -2.18
Ohio      1.02  0.79  -0.86  1.03
Utah      0.44  0.91  -0.63 -0.29

#### Sort rows/coloumn index in DataFrame Descending order

In [107]:
data.sort_index(axis=0, ascending=False)

           one   two  three  four
Utah      0.44  0.91  -0.63 -0.29
Ohio      1.02  0.79  -0.86  1.03
New York  0.88 -0.04   0.82 -2.18
Colorado  1.17 -0.56  -0.66  0.51
Arizona  -0.82  1.24  -1.38 -0.51

### Sorting by Values
<li>Sort a Series by its values, use its sort_values method

In [108]:
obj = pd.Series([4, 7, -3, 2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [109]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

#### Similarly in DataFrame specify Column name using 'by' parameter
<li>sort_values : Sort by the values

In [110]:
data.sort_values(by='two', ascending= False)

           one   two  three  four
Arizona  -0.82  1.24  -1.38 -0.51
Utah      0.44  0.91  -0.63 -0.29
Ohio      1.02  0.79  -0.86  1.03
New York  0.88 -0.04   0.82 -2.18
Colorado  1.17 -0.56  -0.66  0.51

#### For multiple column sort pass list of columns

In [111]:
data.sort_values(by=['one', 'two'])

           one   two  three  four
Arizona  -0.82  1.24  -1.38 -0.51
Utah      0.44  0.91  -0.63 -0.29
New York  0.88 -0.04   0.82 -2.18
Ohio      1.02  0.79  -0.86  1.03
Colorado  1.17 -0.56  -0.66  0.51

### Ranking

In [112]:
obj = pd.Series([2, 1, 3, 5, 2, 3], index=['a', 'b', 'c', 'd', 'e', 'f'] )
obj

a    2
b    1
c    3
d    5
e    2
f    3
dtype: int64

### Rank the elements based on ascending order

<li>Compute numerical data ranks (1 through n) along axis. Equal values are assigned a rank that is the average of the ranks of those values

Parameters
----------
axis : {0 or 'index', 1 or 'columns'}, default 0
    index to direct ranking<br>
method : {'average', 'min', 'max', 'first', 'dense'}
    * average: average rank of group
    * min: lowest rank in group
    * max: highest rank in group
    * first: ranks assigned in order they appear in the array
    * dense: like 'min', but rank always increases by 1 between groups
numeric_only : boolean, default None
    Include only float, int, boolean data. Valid only for DataFrame or
    Panel objects <br>
na_option : {'keep', 'top', 'bottom'}
    * keep: leave NA values where they are
    * top: smallest rank if ascending
    * bottom: smallest rank if descending
ascending : boolean, default True
    False for ranks by high (1) to low (N)<br>
pct : boolean, default False
    Computes percentage rank of data

In [113]:
obj

a    2
b    1
c    3
d    5
e    2
f    3
dtype: int64

In [114]:
obj.rank(method='max')  #how does the ranking works when method=average NOT SURE
#Check the documentation for all the METHODS

a    3.0
b    1.0
c    5.0
d    6.0
e    3.0
f    5.0
dtype: float64

### Retriving Series/DataFrame Information

In [115]:
df=pd.DataFrame([[3,4,5],[6,2,8],[4,6,8]],index=['a','b','c'],columns=['one','two','three'])
df

   one  two  three
a    3    4      5
b    6    2      8
c    4    6      8

#### Basic Information

In [116]:
df.shape

(3, 3)

In [117]:
df.index  #Describe index

Index(['a', 'b', 'c'], dtype='object')

In [118]:
df.columns #Describe DataFrame columns

Index(['one', 'two', 'three'], dtype='object')

In [119]:
df.info() #Info on DataFrame

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, a to c
Data columns (total 3 columns):
one      3 non-null int64
two      3 non-null int64
three    3 non-null int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [120]:
df.count() #Count No. of non-NA values

one      3
two      3
three    3
dtype: int64

### Summary

In [121]:
df.sum() #Sum across rows

one      13
two      12
three    21
dtype: int64

In [122]:
df.sum(axis=0) #Sum across coloumn

one      13
two      12
three    21
dtype: int64

### Descriptive Summary - Continuous Variables

In [123]:
df.describe()

        one  two  three
count  3.00  3.0   3.00
mean   4.33  4.0   7.00
std    1.53  2.0   1.73
min    3.00  2.0   5.00
25%    3.50  3.0   6.50
50%    4.00  4.0   8.00
75%    5.00  5.0   8.00
max    6.00  6.0   8.00

In [124]:
df

   one  two  three
a    3    4      5
b    6    2      8
c    4    6      8

In [125]:
df.one.cumsum() #cummultive sum of values
#or df['one'].cumsum()

a     3
b     9
c    13
Name: one, dtype: int64

In [126]:
df.min(axis=0) #df.max() : To find the min and max values

one      3
two      2
three    5
dtype: int64

In [127]:
df.idxmin()  #Minimum and Maximum Index Values

one      a
two      b
three    a
dtype: object

In [128]:
df.mean() #Mean of values

one      4.33
two      4.00
three    7.00
dtype: float64

In [129]:
df.median() #Median of values

one      4.0
two      4.0
three    8.0
dtype: float64

#### Descriptive Summary - Categorical Variables

In [130]:
df = pd.DataFrame([['mobile', 'tv'], ['camera', 'tv'],['mobile', 'monitor'], ['mobile', 'projecor'],
                  ['mobile', 'monitor'], ['mobile', 'monitor'],['camera', np.nan], ['mobile', 'tv']],
                  index=['a', 'b', 'c', 'd','e','f','g','h'],
                  columns=['one', 'two'])
df

      one       two
a  mobile        tv
b  camera        tv
c  mobile   monitor
d  mobile  projecor
e  mobile   monitor
f  mobile   monitor
g  camera       NaN
h  mobile        tv

In [131]:
#Descriptive Summary - Categorical Variables
df.describe()  # Describe ignores object type column

           one two
count        8   7
unique       2   3
top     mobile  tv
freq         6   3

In [132]:
df

      one       two
a  mobile        tv
b  camera        tv
c  mobile   monitor
d  mobile  projecor
e  mobile   monitor
f  mobile   monitor
g  camera       NaN
h  mobile        tv

In [133]:
#Finding Unique in each column
#Applies function along input axis of DataFrame.
df.apply(lambda x: x.nunique(), axis=0)

one    2
two    3
dtype: int64

In [134]:
df.one.unique()  ## gives you an array of the unique values in a Series

array(['mobile', 'camera'], dtype=object)

In [135]:
df.one.value_counts().sort_index()  # shows value frequencies, shows highest values in top

camera    2
mobile    6
Name: one, dtype: int64

###  ' isin ' is responsible for vectorized set membership

In [136]:
obj

a    2
b    1
c    3
d    5
e    2
f    3
dtype: int64

In [137]:
obj[obj.isin(['3', '5'])]

c    3
d    5
f    3
dtype: int64

In [138]:
df.one.isin(['mobile'])

a     True
b    False
c     True
d     True
e     True
f     True
g    False
h     True
Name: one, dtype: bool

### Handling Missing Data

In [139]:
data = pd.DataFrame([[np.nan, 6.5, np.nan, 30.], 
                     [np.nan, np.nan, np.nan, np.nan],
                     [3., np.nan, 1., 43.],
                     [np.nan, np.nan, 1., np.nan],
                     [3., 2., 3, 76.],
                     [5., np.nan, 6., np.nan],
                     [np.nan, np.nan, 1., np.nan], 
                     [np.nan, 6.5, 3., np.nan]],
                     index=['a','b','c','d','e','f','g','h'],
                   columns=['one','two','three','four'],dtype=np.float64)

In [140]:
data.rename_axis({"one": "ehh", "two": "see"}, axis="columns") #To rename columns

   ehh  see  three  four
a  NaN  6.5    NaN  30.0
b  NaN  NaN    NaN   NaN
c  3.0  NaN    1.0  43.0
d  NaN  NaN    1.0   NaN
e  3.0  2.0    3.0  76.0
f  5.0  NaN    6.0   NaN
g  NaN  NaN    1.0   NaN
h  NaN  6.5    3.0   NaN

### Drop when any observation in a ROW has empty records
<li>.dropna()
#### Parameters
----------
axis : {0 or 'index', 1 or 'columns'}, or tuple/list thereof
    Pass tuple or list to drop on multiple axes
how : {'any', 'all'}
    * any : if any NA values are present, drop that label
    * all : if all values are NA, drop that label
thresh : int, default None
    int value : require that many non-NA values

In [141]:
data.dropna(axis=0,how='any')

   one  two  three  four
e  3.0  2.0    3.0  76.0

In [142]:
#Drop only when whole Variable has empty records
data.dropna(axis=1,how='all')

   one  two  three  four
a  NaN  6.5    NaN  30.0
b  NaN  NaN    NaN   NaN
c  3.0  NaN    1.0  43.0
d  NaN  NaN    1.0   NaN
e  3.0  2.0    3.0  76.0
f  5.0  NaN    6.0   NaN
g  NaN  NaN    1.0   NaN
h  NaN  6.5    3.0   NaN

In [143]:
#Drop until 3 variables with values
data.dropna(thresh=3,axis=0)

   one  two  three  four
c  3.0  NaN    1.0  43.0
e  3.0  2.0    3.0  76.0

### Filling in Missing Data

In [144]:
#Fill all nulls with zeros
data.fillna(0)

   one  two  three  four
a  0.0  6.5    0.0  30.0
b  0.0  0.0    0.0   0.0
c  3.0  0.0    1.0  43.0
d  0.0  0.0    1.0   0.0
e  3.0  2.0    3.0  76.0
f  5.0  0.0    6.0   0.0
g  0.0  0.0    1.0   0.0
h  0.0  6.5    3.0   0.0

In [145]:
data.ix[:,['one','two','three']].mean() #Find mean according to the Label

/Users/apple/anaconda/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

one      3.67
two      5.00
three    2.50
dtype: float64

In [146]:
data.loc['a'].fillna(3) #Fill value according to the index

one       3.0
two       6.5
three     3.0
four     30.0
Name: a, dtype: float64

In [147]:
data.fillna({'one':5,'two':6,'three':9,'four':7}) #Fill value according to label

   one  two  three  four
a  5.0  6.5    9.0  30.0
b  5.0  6.0    9.0   7.0
c  3.0  6.0    1.0  43.0
d  5.0  6.0    1.0   7.0
e  3.0  2.0    3.0  76.0
f  5.0  6.0    6.0   7.0
g  5.0  6.0    1.0   7.0
h  5.0  6.5    3.0   7.0

In [148]:
data.head(-3).fillna(3) #Fill value according to index

   one  two  three  four
a  3.0  6.5    3.0  30.0
b  3.0  3.0    3.0   3.0
c  3.0  3.0    1.0  43.0
d  3.0  3.0    1.0   3.0
e  3.0  2.0    3.0  76.0

#### Short form of mean imputation

In [149]:
data.fillna(data.mean())

    one  two  three   four
a  3.67  6.5    2.5  30.00
b  3.67  5.0    2.5  49.67
c  3.00  5.0    1.0  43.00
d  3.67  5.0    1.0  49.67
e  3.00  2.0    3.0  76.00
f  5.00  5.0    6.0  49.67
g  3.67  5.0    1.0  49.67
h  3.67  6.5    3.0  49.67

### Hierarchical Indexing
<li>Provides a way for you to work with higher dimensional data in a lower dimensional form

SERIES
------

In [150]:
data = pd.Series(np.random.randn(6),
.....: index=[['a','a','a','a','b','b'],[1,2,3,4,1,2]],)
data

a  1    1.16
   2   -0.14
   3   -0.72
   4   -0.49
b  1    0.54
   2    0.29
dtype: float64

UNSTACK
-------
Signature: data.unstack(level=-1, fill_value=None)
________
Docstring:
Unstack, a.k.a. pivot, Series with MultiIndex to produce DataFrame.
The level involved will automatically get sorted.
________
Parameters

<li>level : int, string, or list of these, default last level
    Level(s) to unstack, can pass level name
<li>fill_value : replace NaN with this value if the unstack produces
    missing values

In [151]:
data.unstack(0)  #Puts 1st Index to COLOUMNS

      a     b
1  1.16  0.54
2 -0.14  0.29
3 -0.72   NaN
4 -0.49   NaN

In [152]:
data.unstack(1) #Puts the 2nd Index to coloumns

      1     2     3     4
a  1.16 -0.14 -0.72 -0.49
b  0.54  0.29   NaN   NaN

DataFrame- Hierarchical Indexing/Multi-Index DataFrame
---------

In [153]:
frame=pd.DataFrame(np.arange(12).reshape((4,3)),
index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
columns=[['Ohio', 'Ohio', 'Colorado'],['Green', 'Red', 'Green']])

In [154]:
frame.index.names=['key1','key2']
frame.columns.names=['state','color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [155]:
frame.stack(0) #Reshaping

color               Green   Red
key1 key2 state
a    1    Colorado      2   NaN
          Ohio          0   1.0
     2    Colorado      5   NaN
          Ohio          3   4.0
b    1    Colorado      8   NaN
          Ohio          6   7.0
     2    Colorado     11   NaN
          Ohio          9  10.0

In [156]:
frame.isnull().any()  #To check if there are any NULL Values

state     color
Ohio      Green    False
          Red      False
Colorado  Green    False
dtype: bool

In [157]:
#Sort multilevel index by chosen axis and primary level. Data will be
#lexicographically sorted by the chosen level followed by the other
#levels (in order)
frame.sortlevel(0 , ascending=True)

/Users/apple/anaconda/lib/python3.6/site-packages/ipykernel_launcher.py:4: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  after removing the cwd from sys.path.

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

#### Sort Index levels - But override other level

In [158]:
frame.sort_index(level=1, ascending= False)   # you have to specify level parameter here

state      Ohio     Colorado
color     Green Red    Green
key1 key2
b    2        9  10       11
a    2        3   4        5
b    1        6   7        8
a    1        0   1        2

In [159]:
frame.swaplevel('key2','key1') # Swap Index Level
#frame.swaplevel(1,0) Another way to swap Index

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

#### Summary Statistics by Level

In [160]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

#### Aggregate Fist Level

In [161]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

#### Across Columns

In [162]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Combining and Merging Data Sets

<li><b>pandas.merge</b> connects rows in DataFrames based on one or more keys
<li><b>pandas.concat</b> glues or stacks together objects

In [163]:
df2=pd.DataFrame([[1,2,3],[3,2,1]],index=['a','b']) #Initialize DF: Method 1
df2

   0  1  2
a  1  2  3
b  3  2  1

In [164]:
df3=pd.DataFrame(np.arange(12).reshape(4,3),index=['a','b','c','d']) #Initialize DF: Method 2
df3

   0   1   2
a  0   1   2
b  3   4   5
c  6   7   8
d  9  10  11

In [165]:
df4=pd.DataFrame({'key1':['a','b','c','d'],'FName':['Jose','Martin','Anoop','Frank']}) #Initializing DF Method 3
df4

    FName key1
0    Jose    a
1  Martin    b
2   Anoop    c
3   Frank    d

In [166]:
df5=pd.DataFrame({'key1':['a','b','c'],'LName':['Alex','Jospeh','Antnoy']}) #Initializing DF Method 4
df5

    LName key1
0    Alex    a
1  Jospeh    b
2  Antnoy    c


#### use 'key' for merging data
<li>merge uses the overlapping column names as the keys
<li>merge ignored row with key d from df1

In [167]:
pd.merge(df4,df5)

    FName key1   LName
0    Jose    a    Alex
1  Martin    b  Jospeh
2   Anoop    c  Antnoy

In [168]:
#What if there is no Same name column?
df5.columns=['key2','LNAME']

In [169]:
pd.merge(df4,df5,left_on='key1',right_on='key2',how='outer') #NOT SURE

    FName key1    key2 LNAME
0    Jose    a     NaN   NaN
1  Martin    b     NaN   NaN
2   Anoop    c     NaN   NaN
3   Frank    d     NaN   NaN
4     NaN  NaN    Alex     a
5     NaN  NaN  Jospeh     b
6     NaN  NaN  Antnoy     c

### Concatenating

In [170]:
s1=pd.Series(np.arange(2),index=['a','b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])

In [171]:
pd.concat([s1,s2,s3]) #Concat along rows

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [172]:
pd.concat([s1,s2,s3],axis=1) #Concat along column

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [173]:
data=pd.DataFrame({'k1':['one']*3 + ['two']*4,'k2': [1, 1, 2, 3, 3, 4, 4]},)
data
#Another way to initialize the DF

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

### Removing Duplicates

In [174]:
data.duplicated() #NOTE : This function returns a series

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [175]:
data.drop_duplicates()   
# remove all the cases where boolean is true...means is duplicated entry
# by default consider all of the columns;

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

#### Removing Duplicates based on only one column

range(start, stop[, step]) -> range object

Return an object that produces a sequence of integers from start (inclusive)
to stop (exclusive) by step.  range(i, j) produces i, i+1, i+2, ..., j-1.
start defaults to 0, and stop is omitted!  range(4) produces 0, 1, 2, 3.
These are exactly the valid indices for a list of 4 elements.
When step is given, it specifies the increment (or decrement).

In [189]:
data['v1']=np.linspace(0,12,7,dtype=np.int64)

In [190]:
data

    k1  k2  v1
0  one   1   0
1  one   1   2
2  one   2   4
3  two   3   6
4  two   3   8
5  two   4  10
6  two   4  12

In [191]:
data.drop_duplicates(['k1'], keep='first')  # always keep the first observation

    k1  k2  v1
0  one   1   0
3  two   3   6

In [192]:
data.drop_duplicates(['k1', 'k2'], keep='last')
#Multicolumn

    k1  k2  v1
1  one   1   2
2  one   2   4
4  two   3   8
6  two   4  12

#### Lookup using Map Funciton
<li>Suppose you wanted to add a column indicating the type of animal that each food came from in below table

In [193]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'pastrami',
.....: 'corned beef', 'bacon', 'pastrami', 'honey ham','nova lox'],
.....: 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [202]:
meat_to_animal = {'bacon': 'pig',
                  'pulled pork': 'pig',
                  'pastrami': 'cow',
                  'corned beef': 'cow',
                  'honey ham': 'pig',
                  'nova lox': 'salmon'}
meat_to_animal

{'bacon': 'pig',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon',
 'pastrami': 'cow',
 'pulled pork': 'pig'}

In [203]:
data['animals']=data['food'].map(meat_to_animal)
data

          food  ounces animals
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

#### Replacing dubious Values

In [204]:
data = pd.Series([1., -999., 2., -999., 1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4    1000.0
5       3.0
dtype: float64

In [205]:
data.replace(1000,np.nan)

0      1.0
1   -999.0
2      2.0
3   -999.0
4      NaN
5      3.0
dtype: float64

In [206]:
# replacing muplitple items at once
data.replace([-999, 1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

#### Seperate replacement for different value

In [208]:
data.replace([-999, 1000], [0, np.nan])

0    1.0
1    0.0
2    2.0
3    0.0
4    NaN
5    3.0
dtype: float64

#### Using dictionary

In [209]:
# alteratively you can use dictionary
data.replace({-999: 0, 1000: np.nan})

0    1.0
1    0.0
2    2.0
3    0.0
4    NaN
5    3.0
dtype: float64

### Altering Indexes